{"air_date":"1991-02-28","crew":[{"id":1215631,"credit_id":"5257fe77760ee36aaa743928","name":"Rob Grant","department":"Writing","job":"Writer","profile_path":null},{"id":1215632,"credit_id":"5257fe75760ee36aaa7433d6","name":"Doug Naylor","department":"Writing","job":"Writer","profile_path":null},{"id":66162,"credit_id":"5257fe75760ee36aaa743418","name":"Ed Bye","department":"Directing","job":"Director","profile_path":"/dFlVFGogLiiYjXjVCxnTDzBSR3t.jpg"}],"episode_number":3,"guest_stars":[{"id":1242514,"name":"James Smillie","credit_id":"5257fe8a760ee36aaa7453ee","character":"","order":0,"profile_path":null},{"id":26707,"name":"Nicholas Ball","credit_id":"5257fe8a760ee36aaa745432","character":"","order":1,"profile_path":"/p4vsZv7iZ6nwMlitTI7IogK2pfk.jpg"}],"name":"Justice","overview":"Lister is in bed with \"space mumps\" when he hears the news that the gang has brought aboard a cryo-pod from a prison ship which possibly contains a guard named Barbara Bellini.\n\nLister inspects the pod and begins the thawing process, which Rimmer objects to, saying that there were two survivors aboard the ship: Ms Bellini and a Simulant prisoner (Simulants are droids who are noted to be murderous and insane). Since it is too late -- they cannot stop the thawing process -- they decide to travel to the prison colony that the ship was heading for.\n\nThey arrive on the space station and walk through a white light which Kryten says is a mind probe to seek out any unpunished criminal activity. Lister gets very edgy and confesses that he had committed some minor crimes as a teenager. \n\nThe justice computer passes his verdict on them: Kryten and Cat get off, Lister does so, but barely. Rimmer, however, is sentenced to 9000 years in prison for the second degree murder of the Red Dwarf's complement of 1167 personnel -- not counting himself or Lister.\n\nKryten believes that he can defend Rimmer and reverse the verdict and he fronts up to the justice computer, describing to it all about Rimmer's extreme inadequacy and sheer hopelessness. The computer eventually concedes that Rimmer should not have been held accountable for the deaths and releases him due to incompetence.\n\nMeanwhile the pod has thawed and the occupant has escaped. It is, of course, the simulant who was inside and he chases them through the colony. Lister finally beats him by using the power of the justice field - whatever crime you commit against someone else, the consequences happen to you. When the simulant fires at Lister, the bullets hit him instead of Lister, when he throws a knife, it comes back and hits him and so forth.\n\nThe gang head back to Red Dwarf with Lister droning on and on about justice and freedom until he falls down a manhole.\n\n\"Thank God for that\" remarks Cat.","id":421432,"production_code":null,"season_number":4,"still_path":null,"vote_average":0.0,"vote_count":0}
