{"status":"success","code":200,"message":"ok","data":{"id":"tt0684184","type":"title","title":null,"year":null,"description":"In the aftermath of the battle with their future selves, the crew, resurrected from the dead, due to time paradoxes and Lister is depressed when he learns the curry supplies were destroyed in the battle. But all hell breaks loose yet again, when Lister uses Kryten's spare-head \"Spare Head 2\" to take them back into time to get some curries from Earth. Only to change the assassination of President John F. Kennedy and create a alternate dimension.                Written byDaniel Williamson","certificate":null,"duration":"29min","released":"1997-01-17","cast":["Chris Barrie","Craig Charles","Danny John-Jules","Robert Llewellyn","Michael Shannon","Toby Aspin","Peter Gaitens","Robert Ashe"],"genres":["comedy","sci-fi"],"directors":[],"writers":[],"image":"https:\/\/images-na.ssl-images-amazon.com\/images\/M\/MV5BMTYxMzEyNTY3NV5BMl5BanBnXkFtZTgwMjQ5Mjg0MjE@._V1_UY268_CR87,0,182,268_AL_.jpg","review":{"text":"On the surface, this episode is in terrible taste. It plays sort of as a parody of the legendary &quot;Star Trek&quot; episode &quot;City on the Edge of Forever.&quot; Dave Lister and pals inadvertently go back in time to Dallas November 22, 1963, and foil Lee Harvey Oswald&#39;s attempt on John F. Kennedy. They soon find out that because of their actions, the U.S.A. disintegrated and the USSR won the space race. In order to set things right they go back in time to find a now impeached JFK (whose womanizing ways finally caught up with him), and persuade him to become the second gunman behind the &quot;Grassy Knoll,&quot; thus saving his country and his place in history. In the end the episode turns into a surprisingly poignant tribute to the late president, doing a better job of conveying the meaning of his life and death than many more responsible productions. KERA, the PBS affiliate in Dallas, runs this episode every year around the anniversary of the assassination.","rating":"10\/10"}},"donation":{"message":"Please, donate to keep this service alive and help its further development","donation_url":"https:\/\/www.paypal.com\/cgi-bin\/webscr?cmd=_s-xclick&hosted_button_id=92KZCBD2PXMZQ"}}
