{"status":"success","code":200,"message":"ok","data":{"id":"tt0684147","type":"title","title":null,"year":null,"description":"Searching for a new head for Kryten (which exploded due to an incident involving ketchup and lobster), the crew encounter a rogue simulant on a deserted ship. The simulant kidnaps Kryten and commissions one of his own droids, Able, to fix him up. But Kryten and Able discover they're brothers, the same model, and Able helps Kryten escape. But not before Kryten discovers a disturbing secret about his creation...                Written byWalsh (R-DBP)","certificate":null,"duration":"29min","released":"1997-02-21","cast":["Craig Charles","Danny John-Jules","Robert Llewellyn","Chloë Annett","Don Henderson","Vicky Ogden","Alina Proctor","Catherine Harvey","Sophia Thierens","Rebecca Katz","Julia Lloyd"],"genres":["comedy","sci-fi"],"directors":[],"writers":[],"image":"https:\/\/images-na.ssl-images-amazon.com\/images\/M\/MV5BNDcwMTA1NzgxMl5BMl5BanBnXkFtZTgwMTc3Mjg0MjE@._V1_UY268_CR87,0,182,268_AL_.jpg","review":{"text":"My favourite episode of the long running sci-fi sitcom &#x27;Red Dwarf&#x27;.It is the anniversary of the day the crew rescued Kryten from the Nova-5 crash and so he has set about preparing a fancy dinner which consists of lobster and green wine. However, Lister, Cat and Kochanksi are more interested in taking part in a virtual reality equivalent of &#x27;Pride &#x26; Prejudice&#x27;. Hurt and annoyed, Kryten decides to hack into the game with a W.W II tank and eliminates the game characters.Back on ship, during a fraught dinner party, Lister makes the mistake of asking Kryten for some brown sauce for his lobster. This request causes Kryten&#x27;s anger to spiral out of control to the point where his head literally explodes. Scouring an abandoned ship named the SS Centauri for spare android heads, they are busted by a rogue simulant who steals Kryten and takes him aboard his ship. It is there Kryten, after being repaired, meets Able, an android with the same motherboard as himself ( which in effect makes them brothers ). Able is addicted to a substance known as Otrazone, which has completely fried his circuits. It transpires that Able has turned into a &#x27;zoney&#x27; after learning of a terrible secret about his creator, a discovery which later affects Kryten however he is soon calmed down by Lister who tells him he has evolved beyond his personality.Able later escapes with Kryten and the crew on Starbug, which prompts the simulant to give chase. After Able accidentally reveals their position, the simulant starts attacking the ship, causing the crew to fear for their lives. Desperate to save the crew, Able commands control of an escape pod and engulfs the simulant&#x27;s ship in all of the negativity from Kryten&#x27;s nega drive, which makes the simulant depressed beyond measure and causes him to take his own life by blowing up his ship. However, the explosion causes Able&#x27;s pod to crash land, destroying him beyond repair...Written by Robert Llewellyn, who played Kryten, this episode is a little cracker, giving him the opportunity to shine throughout. Llewellyn wrote this episode with the intent of not having to appear much in it as the appliance of the Kryten make up irritated him. However, appearing here as Able as well as Kryten meant he had to appear twice as much, wearing twice as much make-up ( Able was a green palette swap of Kryten, whose costume was black ). The scene in which Kryten appears in the V.R game driving a tank is priceless. The looks on the cast&#x27;s faces here are wonderful and this scene is definitely deserving of a round of applause.For me though, the scene in which Kryten first becomes acquainted with Able is when the episode really hits the nail. Able&#x27;s inability to answer questions without having to recover data from his long term memory retrieval bank ( which involves him gripping his temple and grunting ) is a real hoot. Though the scene towards the end in which Able sacrifices himself to save the crew&#x27;s lives, unusually for &#x27;Red Dwarf&#x27; has a distinct air of pathos to it.The late Don Henderson plays the simulant. His raspy sounding voice was not a special effect put on for the character, as many of the show&#x27;s fans believe. He was in fact suffering from throat cancer and died not long after.Funniest moment - Kryten warning Able that his intake of Otrazone will corrupt his circuit boards. &#x27;&#x27;That&#x27;s what people say but where&#x27;s the evidence?&#x27;&#x27; replies Able rhetorically, only seconds later to ask &#x27;&#x27;have I just said that?&#x27;&#x27;.Second funniest moment - After Able&#x27;s heroic act, Kryten requests permission to recover his body and perform last rites, which the crew give their blessing to. As Kryten carries the now defunct android, Lister asks if he needs help. &#x27;&#x27;He ain&#x27;t heavy, sir, he&#x27;s my brother!&#x27;&#x27; says Kryten proudly. A blatant nod to The Hollies Number. 1 hit of the same name.","rating":"10\/10"}},"donation":{"message":"Please, donate to keep this service alive and help its further development","donation_url":"https:\/\/www.paypal.com\/cgi-bin\/webscr?cmd=_s-xclick&hosted_button_id=92KZCBD2PXMZQ"}}
