{"status":"success","code":200,"message":"ok","data":{"id":"tt0684183","type":"title","title":null,"year":null,"description":"Lister receives a message from Jim Repear, head of Diva-Droid international, the company that created Kryten. Where they learn Kryten is to be dismantled within 24 hours and replaced by Hudzen 10, a super-strong android. Lister, Cat, Rimmer and Holly decided to throw Krytern a leaving-party, and give Kryten one last night to remember.                Written byDaniel Williamson","certificate":null,"duration":"28min","released":"1989-12-19","cast":["Chris Barrie","Craig Charles","Danny John-Jules","Hattie Hayridge","Robert Llewellyn","Julie Higginson","Gordon Kennedy"],"genres":["comedy","sci-fi"],"directors":[],"writers":[],"image":"https:\/\/images-na.ssl-images-amazon.com\/images\/M\/MV5BMTk5MjY1MTI4MF5BMl5BanBnXkFtZTgwMTQ5Mjg0MjE@._V1_UY268_CR87,0,182,268_AL_.jpg","review":{"text":"Red Dwarf series III was where it really hit its stride and became the phenomenal show we all love. I for one think the first two series are under-appreciated and get far too much criticism for the cheapness and limited scope of them. Despite enjoying the clever writing the first two series provided, series 3 makes a welcome change and fully rejuvenates the show by having the courage (and budget) to explore genuinely interesting science fiction concepts (hence becoming a science fiction\/comedy series rather than a sitcom set in a sci-fi setting). The series also saw the introduction of Kryten, as although he was technically introduced in series two, that version of Kryten was significantly different from this character and Llewellyn&#39;s acting was very different from the actor who played Kryten in his first appearance.Series three sees &quot;Red Dwarf&quot; expanding its horizons and reinventing itself, and the result is a fantastic, hilarious, entertaining, and original science fiction comedy series. Truly great television.I really love &quot;Timeslides&quot;, which I feel is quite underrated and is one of my favorite episodes. However, there are two better episodes in this series- &quot;Backwards&quot; and of course &quot;Polymorph&quot;.Series average based on ratings for all episodes: 9.33\/10","rating":null}},"donation":{"message":"Please, donate to keep this service alive and help its further development","donation_url":"https:\/\/www.paypal.com\/cgi-bin\/webscr?cmd=_s-xclick&hosted_button_id=92KZCBD2PXMZQ"}}
