{"status":"success","code":200,"message":"ok","data":{"id":"tt0684181","type":"title","title":null,"year":null,"description":"Liverpudlian caretaker Dave Lister is sentenced to 18-months in suspended animation for smuggling his pregnant cat Frankenstine on-board. But Dave awakes from Suspended animation, only to find he's been frozen for 3 million years and the crew have been wiped out in a radioactive disaster.                Written byDaniel Williamson","certificate":null,"duration":"30min","released":"1988-02-15","cast":["Chris Barrie","Craig Charles","Danny John-Jules","Norman Lovett","Robert Bathurst","Paul Bradley","David Gillespie","Mac McDonald","Robert McCulley","Mark Williams","Clare Grogan"],"genres":["comedy","sci-fi"],"directors":[],"writers":[],"image":"https:\/\/images-na.ssl-images-amazon.com\/images\/M\/MV5BMTA1MzQyODQ4ODZeQTJeQWpwZ15BbWU3MDM4MDc4Nzg@._V1_UY268_CR87,0,182,268_AL_.jpg","review":{"text":"The first ever episode of the BBC&#x27;s Sci-Fi sitcom witch in my personal opinion is the best show ever made.The episode introduces the main characters and sets up the story backbone of the series. On the mining ship Red Dwarf, Dave Lister is placed in stasis for refusing to give up the whereabouts of his forbidden pet cat. When he emerges from stasis, three million years later, he discovers that everybody has died from a radiation leak.He is not alone though his former buck mate and superior Arnold Rimmer has been resurrected as a hologram by the ship&#x27;s computer Holly to keep lister sane.Also the cat who has evolved from lister&#x27;s pet cat This was first broadcast on the 15 Febuary 1988 and gained an audience of over 5.1 million viewers from its first showing, which was respectable for a post watershed BBC2 programme.This is episode is by far the best episode from the first series of Red Dwarf.At this stage it was still just a sitcom set in space it wasn&#x27;t till the third series it really became a sci-fi show.The Early years of red dwarf sometimes get a negative response from fan&#x27;s because of the limited scope of the storeys but i think it is very unfair the reception they get.","rating":"8\/10"}},"donation":{"message":"Please, donate to keep this service alive and help its further development","donation_url":"https:\/\/www.paypal.com\/cgi-bin\/webscr?cmd=_s-xclick&hosted_button_id=92KZCBD2PXMZQ"}}
