{"status":"success","code":200,"message":"ok","data":{"id":"tt0684167","type":"title","title":null,"year":null,"description":"A escape pod containing a \"Microbe\" a genetically-engineered virus that eats metal and programmed not to harm glass has arrived on-board \"Red Dwarf\" and begins to eat away Red Dwarf. Left on-board \"Red Dwarf\" to die, Rimmer, Lister, Cat, Kryten, Kochanski and Holly find their own chance at finding a antidote is in a mirror universe where everything is opposite, and Rimmer is sent into the Mirror universe to find the antidote before Red Dwarf is destroyed along with Lister, Kryten, Cat and Holly.                Written byDaniel Williamson","certificate":null,"duration":"30min","released":"1999-04-05","cast":["Chris Barrie","Craig Charles","Danny John-Jules","Robert Llewellyn","Chloë Annett","Norman Lovett","Mac McDonald","Graham McTavish","Heidi Monsen","Tony Slattery","Ricky Grover","David Verrey"],"genres":["comedy","sci-fi"],"directors":[],"writers":[],"image":"https:\/\/images-na.ssl-images-amazon.com\/images\/M\/MV5BMTk1MTgwMDA4NF5BMl5BanBnXkFtZTgwNzY3Mjg0MjE@._V1_UY268_CR87,0,182,268_AL_.jpg","review":{"text":"red dwarf is a TV show i have come to love and obsess about through my teenage years. I was an avid fan since the time my dad bought the first season and the series have gone from good to weird to recounting vindaloo related adventures and more OK so the penultimate series dipped but the last picked it up for the end but they didn&#39;t really finish it, it was probably the single most anti-climatic. yet funny ending ever. as the grim reaper starts his dialogue just to have rimmer knee him in... well its rimmer have a guess, and then it ends it just stops and i don&#39;t know why this was, the saving grace series the best one apart from the first and yet it just stopped. maybe the worst red dwarf episode or the best but rimmer giving the most monumental quote that not even Shakespeare could have written will be a childhood memory that lives with me forever.","rating":"8\/10"}},"donation":{"message":"Please, donate to keep this service alive and help its further development","donation_url":"https:\/\/www.paypal.com\/cgi-bin\/webscr?cmd=_s-xclick&hosted_button_id=92KZCBD2PXMZQ"}}
