{"status":"success","code":200,"message":"ok","data":{"id":"tt1400975","type":"title","title":null,"year":null,"description":"Lister's busy day of annoying Rimmer is interrupted by the discovery of a dimension-hopping leviathan in the ship's mile-deep water tank. New hologram Katerina arrives and immediately starts undermining Rimmer - right in front of his stupid, fat, ferrety face.                Written byAnonymous","certificate":null,"duration":"25min","released":"2009-04-12","cast":["Chris Barrie","Craig Charles","Danny John-Jules","Robert Llewellyn","Simon Gregson","Michelle Keegan","Richard O'Callaghan","Chloë Annett"],"genres":["comedy","sci-fi"],"directors":[],"writers":[],"image":"https:\/\/images-na.ssl-images-amazon.com\/images\/M\/MV5BMTY4MDc1NjQ2NV5BMl5BanBnXkFtZTgwOTUzNjE1NTE@._V1_UY268_CR87,0,182,268_AL_.jpg","review":{"text":"I don&#x27;t want to spoil it for anyone who hasn&#x27;t seen it, so let&#x27;s just say part three concludes this mini-series brilliantly.I watched part 1 and sat there going &#x22;Eh... not that funny, sorry guys.&#x22; Then I watched part 2 and was like &#x22;OK... OK... So, uh, you&#x27;re going with movie references, Family Guy style?&#x22; There were some excellent quotes in both episodes, though. Then part 3 completely redeemed it.Acting&#x27;s good, plot&#x27;s interesting and it feels much more mature. I&#x27;d definitely say it&#x27;s better than a lot of what Series 8 had to offer.As for breaking the whole affair into three episodes, it probably wasn&#x27;t the best idea, but it&#x27;s being released on DVD so we&#x27;ll all be able to watch it as intended.Oh, one last thing: SO glad they ditched the laugh track! There just aren&#x27;t enough jokes in the show for that to be a good idea; lots of serious moments.-Lexi C","rating":"9\/10"}},"donation":{"message":"Please, donate to keep this service alive and help its further development","donation_url":"https:\/\/www.paypal.com\/cgi-bin\/webscr?cmd=_s-xclick&hosted_button_id=92KZCBD2PXMZQ"}}
