{"status":"success","code":200,"message":"ok","data":{"id":"tt1999715","type":"title","title":null,"year":null,"description":"Whilst attempting to construct a Swedish flat-pack rejuvenation shower the crew accidentally transport themselves back to the year A.D. 23. In order to power their returner remote they need lemons to make a battery and ,in a Middle Eastern market,meet a friendly young man called Jesus. When Jesus complains of demons on his back the crew successfully teleport him and themselves back to 'Red Dwarf' for an operation but reading of his future fate causes Jesus to return to Earth and behave in a very unchristian manner. The team go after him and learn that Jesus is a commoner name than they had thought.                Written bydon @ minifie-1","certificate":null,"duration":"30min","released":"2012-10-18","cast":["Chris Barrie","Craig Charles","Danny John-Jules","Robert Llewellyn","Indira Joshi","James Baxter","Homer Todiwala"],"genres":["comedy","sci-fi"],"directors":[],"writers":[],"image":"https:\/\/images-na.ssl-images-amazon.com\/images\/M\/MV5BMTUzODUyNjU2NV5BMl5BanBnXkFtZTgwNTg0NTg0MjE@._V1_UY268_CR87,0,182,268_AL_.jpg","review":{"text":"When the crew acquire a new rejuvenating show it is bound to go wrong; especially as it comes from an unnamed Swedish company famous for its flat pack products. Once they have put it together there are inevitably several parts left over. Being unusually cautious they test the device on an old pair of socks; this still doesn&#x27;t save them from being rejuvenated back to Britain in 23AD! Not to worry though; they have the remote control that will take them back... shame they didn&#x27;t put a battery in! Remembering some basic science they decide to make a new battery from lemons... the nearest of which are in India. After a six month walk they finally get there and acquire the required lemons. They then sit down for a meal and are rather surprised to find that there is a peace loving man named Jesus at the next table! One thing leads to another and the five of them end up back on Red Dwarf where Jesus undergoes treatment for a kidney stone and reads about some of the negative consequences of Christianity over the centuries; they are shocking enough for him to decide to return to 23AD and start trashing his reputation!I really liked this episode; it was Red Dwarf at its best. The way they are sent back to 23AD was delightfully silly as was the fact that the people they bump into can speak English because they happen to have visited... despite the fact that the language has changed a lot in 2000 years. I suppose some people might be offended by the Jesus scenes but anybody who wasn&#x27;t offended by &#x27;Life of Brian&#x27; won&#x27;t be offended by this. There were plenty of great gags to be enjoyed; my personal favourite involved Cat taking Lister&#x27;s &#x27;mystery meat&#x27; in the opening scene only to get the real punch line much later on! We also finally learn why Rimmer was given the middle name Judas. With the new series featuring three fine episodes out of three my previous reservations about bringing back &#x27;Red Dwarf&#x27; have been dispelled.","rating":"10\/10"}},"donation":{"message":"Please, donate to keep this service alive and help its further development","donation_url":"https:\/\/www.paypal.com\/cgi-bin\/webscr?cmd=_s-xclick&hosted_button_id=92KZCBD2PXMZQ"}}
