{"status":"success","code":200,"message":"ok","data":{"id":"tt1997038","type":"title","title":null,"year":null,"description":"The crew discover the pristine,empty spaceship Trojan and use it to travel to the aid of Columbus III,to answer a distress call from Rimmer's brother Howard,who used to bully him. However Rimmer is too proud to help until he can equal Howard in rank and become an officer. He thus has fifteen hours to sit the Astro-Nav promotion exam which he has failed on ten previous occasions. The others work out that Rimmer's head is too full of past resentment to clear a space for exam data but when the Trojan eventually rides to the rescue Rimmer discovers that Howard is not what he claims to be.                Written bydon @ minifie-1","certificate":null,"duration":"40min","released":"2012-10-04","cast":["Chris Barrie","Craig Charles","Danny John-Jules","Robert Llewellyn","Mark Dexter","Susan Earl","Lucy Newman-Williams","Bryan Bounds","Laurence Bouvard","Rupert Degas"],"genres":["comedy","sci-fi"],"directors":[],"writers":[],"image":"https:\/\/images-na.ssl-images-amazon.com\/images\/M\/MV5BMjE1OTg3MjA3Nl5BMl5BanBnXkFtZTcwODUyNTg1OA@@._V1_UY268_CR4,0,182,268_AL_.jpg","review":{"text":"When I saw Back to Earth I wept a little as I thought they had ruined a once great series with bad jokes, crappy gimmicks, bad over the top special effects and a setup that looked far to clean and expensive to be Red Dwarf. After watching this episode I can confidently say that they have managed to rescue the series, everything looks a little dirtier and the jokes are funny again, perhaps there is still a bit too many special effects and the cast besides Rimmer seem a little awkward in their roles however I think that will change if the series continues and they get comfortable with the roles again.Glad you back guys !","rating":"7\/10"}},"donation":{"message":"Please, donate to keep this service alive and help its further development","donation_url":"https:\/\/www.paypal.com\/cgi-bin\/webscr?cmd=_s-xclick&hosted_button_id=92KZCBD2PXMZQ"}}
