{"status":"success","code":200,"message":"ok","data":{"id":"tt1999718","type":"title","title":null,"year":null,"description":"The Red Dwarf is surrounded by hostile Annihilators and a Simulant death ship,with only two forks and a pencil sharpener for weapons. The crew flee in the shuttle and hide in an asteroid where Rimmer plays a hologram of his father,only to learn he was not his father after all. Free of paternal scorn at last he concocts a clever plan,which destroys the enemies and Red Dwarf lives to see another day.                Written bydon @ minifie-1","certificate":null,"duration":"32min","released":"2012-11-08","cast":["Chris Barrie","Craig Charles","Danny John-Jules","Robert Llewellyn","Richard O'Callaghan","Gary Cady","Alex Hardy","Colin Hoult","Simon Treves","Taylor James","Philip Labey","Joanne Gale"],"genres":["comedy","sci-fi"],"directors":[],"writers":[],"image":"https:\/\/images-na.ssl-images-amazon.com\/images\/M\/MV5BNzU3MDg3MTQ2MF5BMl5BanBnXkFtZTgwMjM0NTg0MjE@._V1_UY268_CR87,0,182,268_AL_.jpg","review":{"text":"When it was first on I did used to watch Red Dwarf but I cannot remember it that well and certainly couldn&#x27;t tell you what season I stopped making it an appointment in my schedule (back when you had to be there when it was on TV as opposed to having a million ways to watch it). When the TV channel Dave resurrected Red Dwarf for three episodes, the results were pretty meh but I guess the ratings must have been better because they came back for a full run of 6 episodes. While the special episodes last year tried to be a bit smart and self-referential, Red Dwarf X seems to go back to its roots in terms of its aims. For many this will be great news but as it turned out for me, this was a mixed bag which mostly served to remind me that sometimes comedy doesn&#x27;t date well.So on one hand we have the basic comedy and canned laughter that the show always did well, but then on the other hand, well, we have just that and not much more. I found it amusing for most of the season but there was at least one episode where I didn&#x27;t so much as raise a smile. There is a tiredness to the material that I didn&#x27;t think it ever shook off &#x96; surprising for a show just given a new lease of life. The plots feel a bit recycled and the material and relationships feel stale and lacking inspiration. It does have some funny moments along the way whether it be scenarios or specific lines, but mostly it really bumbled along on the &#x22;amusing at best&#x22; level.The cast are not to blame though because their delivery is fairly committed &#x96; the lines they have to say and the characters they are playing lack spark but it is not the fault of their delivery. Charles continues to do a good job of playing a slob with poor hygiene, John-Jules is simple and slick, Barrie is stuck-up and pompous and Llewellyn continues to get more than his fair share of the good lines. None of them are brilliant but they all do what they are there to do &#x96; just not much more than that.Fans may love the return of this show and in fairness I can understand that, because it has sort of gone back to its roots for this 10th season, however for me this just serves to remind me why I gradually stopped watching it. The comedy is basic and the episodes, while amusing, seem to lack a spark or inspiration to them.","rating":null}},"donation":{"message":"Please, donate to keep this service alive and help its further development","donation_url":"https:\/\/www.paypal.com\/cgi-bin\/webscr?cmd=_s-xclick&hosted_button_id=92KZCBD2PXMZQ"}}
