{"status":"success","code":200,"message":"ok","data":{"id":"tt1999717","type":"title","title":null,"year":null,"description":"Lister finds himself in a bizarre love triangle with two talking vending machines - sweet-voiced coffee maker number 23 and the more vengeful chocolate bar dispenser number 34 and ends up literally getting his leg over with 34. The mail arrives from earth and Lister gets a letter from a pregnant ex-lover of whose child he may be the father. He and Rimmer hunt through piles of old mail for proof but ultimately Lister is disappointed to learn that he is not the one.                Written bydon @ minifie-1","certificate":null,"duration":"31min","released":"2012-11-01","cast":["Chris Barrie","Craig Charles","Danny John-Jules","Robert Llewellyn","Isla Ure"],"genres":["comedy","sci-fi"],"directors":[],"writers":[],"image":"https:\/\/images-na.ssl-images-amazon.com\/images\/M\/MV5BMTgzMTg2NTk2NV5BMl5BanBnXkFtZTgwMzA0NTg0MjE@._V1_UY268_CR87,0,182,268_AL_.jpg","review":{"text":"As this episode opens Lister is feeling down; he is missing the human race and despite Kryten&#x27;s attempts to cheer him he just can&#x27;t get over the fact that he is the only human being left. Things look like they might get better for him when the mail pod arrives bringing a sack of million year old letters; including a parking fine for Rimmer and a letter to Dave from the only girlfriend who didn&#x27;t dump him... she was pregnant and there was a fifty percent chance that he was the father. He spends the rest of the episode trying to find out if there was a second letter revealing the results of her paternity test. In a secondary plot also involving Lister one of the vending machines thinks Lister is hitting on her\/it which causes another one to get jealous. There is also a plot involving Rimmer trying to bribe the doctor with the ship&#x27;s supply of toilet paper so that he won&#x27;t get demoted for failing to turn up to work.I think this was probably the weakest episode of series ten; that isn&#x27;t to say it was bad though as I thought the previous episodes were really good whereas this one was just pretty good. There were some good laughs even if they were a little bit predictable; I&#x27;m sure most viewers will guess that the letters won&#x27;t contain good news. The plot involving the vending machines was a bit weak although it did lead to a very amusing moment where Lister was trying to lift up a vending machine that had fallen over but it looks like he is doing something entirely different!","rating":"7\/10"}},"donation":{"message":"Please, donate to keep this service alive and help its further development","donation_url":"https:\/\/www.paypal.com\/cgi-bin\/webscr?cmd=_s-xclick&hosted_button_id=92KZCBD2PXMZQ"}}
