{"status":"success","code":200,"message":"ok","data":{"id":"tt1999714","type":"title","title":null,"year":null,"description":"Whilst Lister writes himself a father's day card the others give Pree,the ship's computer,a glamorous upgrade. However she is soon putting the ship in danger and setting it on a collision course with the sun while it fills with laughing gas. Her excuse is that Rimmer has programmed her to imitate his own incompetence. Fortunately Lister takes advantage of the fact that he is his own father and,in that capacity, not a crew member to shut down Pree and save the day.                Written bydon @ minifie-1","certificate":null,"duration":"32min","released":"2012-10-11","cast":["Chris Barrie","Craig Charles","Danny John-Jules","Robert Llewellyn","Rebecca Blackstone","Kerry Shale"],"genres":["comedy","sci-fi"],"directors":[],"writers":[],"image":"https:\/\/images-na.ssl-images-amazon.com\/images\/M\/MV5BMTQ2MjE3NzI4M15BMl5BanBnXkFtZTgwMjgzNTg0MjE@._V1_UY268_CR87,0,182,268_AL_.jpg","review":{"text":"I&#x27;ve loved &#x22;Red Dwarf&#x22; from the very beginning, but I&#x27;d also be the first to tell you that it hasn&#x27;t exactly been consistent in its quality. While rarely flat out terrible, there are almost as many middling episodes as there are great ones. This thankfully is one of the truly great ones.This is a case where the A and B stories merge together into near perfection, culminating in a pitched perfect climax. Lister has seemingly come to terms with the fact that he is in fact his own father (see Series 7) but when he truly starts looking at the relationship he has with himself in father\/son terms, he suddenly feels inadequate in both roles. While he tries to sort this out in a way that only Lister would ever think of, the rest of the crew try to install a new operating system for the ship with predictably non-ideal results. The actual way this pans out is quite clever despite the initial set up being predictable.All performers are in top form, but Craig Charles as Lister really knocks this one out of the park. It&#x27;s hilarious, exciting, oddly touching at points and genuinely clever in its execution.","rating":"10\/10"}},"donation":{"message":"Please, donate to keep this service alive and help its further development","donation_url":"https:\/\/www.paypal.com\/cgi-bin\/webscr?cmd=_s-xclick&hosted_button_id=92KZCBD2PXMZQ"}}
