{"status":"success","code":200,"message":"ok","data":{"id":"tt1999716","type":"title","title":null,"year":null,"description":"Whilst Cat and Kryten find themselves doing everything in unison due to 'quantum entanglement' Lister loses the shuttle craft 'Starbug' and Rimmer to a group of hairy genetically engineered life forms in a poker game. To ensure he keeps his side of the bargain within twenty-four hours they have attached an explosive device to his groin due to go off when the time is up. Having unsuccessfully tried to bargain with them with the 'spoon of destiny' the crew have to locate Professor Edgington,the inventor of the groinal exploder,to save the day - which she does,though Rimmer's chances of romance are cruelly dashed.                Written bydon @ minifie-1","certificate":null,"duration":"31min","released":"2012-10-25","cast":["Chris Barrie","Craig Charles","Danny John-Jules","Robert Llewellyn","Steven Wickham","Peter Elliott","Nik Williams","Jun Matsuura","Sydney Stevenson","Emma Campbell-Jones","Nick Barber"],"genres":["comedy","sci-fi"],"directors":[],"writers":[],"image":"https:\/\/images-na.ssl-images-amazon.com\/images\/M\/MV5BMTQ4MzA2MDQ1OV5BMl5BanBnXkFtZTgwNjgzNTg0MjE@._V1_UY268_CR87,0,182,268_AL_.jpg","review":{"text":"After sensors indicate life forms on a nearby moon Lister investigates and when he returns it he tells Kryten that he lost Starbug one and Rimmer in a came of cards! When Rimmer learns that he is to be handed over to the BEGGs (Biologically Engineered Garbage Gobblers) he suggests running... there is a problem though; they have forced Lister to wear a groinal exploder that will detonate in twenty four hours to ensure he pays up... needless to say Dave doesn&#x27;t want to have his groin exploded! If this wasn&#x27;t enough something has happened to make Kryten and Cat act in unison for much of the time; an effect of this is a dramatic increase in coincidences. The crew return to the BEGGs hoping to find a way out of there predicament but by an amazing coincidence the three BEGGs all choke to death at the same time; this gets them out of the gambling debt but Dave&#x27;s groin is still in danger; to save it they will have to go to a strange research station and meet the universe&#x27;s &#x27;wrongest&#x27; woman!Having stopped worrying about the likely quality of new episodes I sat down expecting a good laugh and was not disappointed. From the opening where Lister causes a small fire where his monster kebab leaks onto the console to the end where Rimmer&#x27;s obsession with health and safety directly leads to somebody falling out of an airlock! Along the way there are plenty of gags which are delightfully silly; I loved the idea of the BEGGs but was relieved that we didn&#x27;t see them eating!","rating":"9\/10"}},"donation":{"message":"Please, donate to keep this service alive and help its further development","donation_url":"https:\/\/www.paypal.com\/cgi-bin\/webscr?cmd=_s-xclick&hosted_button_id=92KZCBD2PXMZQ"}}
