{"status":"success","code":200,"message":"ok","data":{"id":"tt5218284","type":"title","title":null,"year":null,"description":"When the crew comes across an explorer ship Rimmer saves the life of its captain, Edmund Herring, who has had trouble with his bio-copier machine and who promoters Rimmer out of gratitude. Rimmer consequently opens an officers' club, filling it with cloned versions of himself via the bio-copier to the annoyance of the others. However a snarl-up in the machine produces a mutant monster Rimmer who must be destroyed at all costs.                Written bydon @ minifie-1","certificate":null,"duration":"28min","released":"2016-10-13","cast":["Chris Barrie","Craig Charles","Danny John-Jules","Robert Llewellyn","Stephen Critchlow","Penelope Freeman","Daniel Barker"],"genres":["comedy","sci-fi"],"directors":[],"writers":[],"image":"https:\/\/images-na.ssl-images-amazon.com\/images\/M\/MV5BNTlmMmE3YTgtMTFmMC00NWE2LThlZWMtYzZmYzc2NmExNjM0XkEyXkFqcGdeQXVyOTc1NjYzNg@@._V1_UY268_CR147,0,182,268_AL_.jpg","review":{"text":"Doug Naylor gets to poke fun of those newfangled 3D printers. The Red Dwarf crew encounter an explorer ship whose captain has been produced by a bio-copier machine. Unfortunately it got jammed so his face was printed on his head.I can see this being a common occurrence when 3D Printers take off. The thing being jammed or the ink running out at an inopportune time.The explorer ship is in the other side of the asteroid belt and its dangerous cargo is at risk of blowing up Red Dwarf, Rimmer fires a missile which gets deflected and ends up saving the life of the ship&#x27;s captain.To show his gratitude he promotes Rimmer and makes him officer class. Rimmer always wanted to be an officer shows the worse of his arrogant and smug side of his character. He creates an officer only lifts, corridors and an officer only lounge. He uses the bio-copier to create duplicates of himself. This greatly annoys Cat and Lister.Again this felt like a vintage episode where we used to see the worse aspects of Rimmer, his cowardice and arrogance. There is a great scene when Kryten tells Lister how to get rid of the database in the bio-machine.However I get the feeling the budget run out in this episode as it just ends abruptly as the crew tackle the Rimmer monster.","rating":"5\/10"}},"donation":{"message":"Please, donate to keep this service alive and help its further development","donation_url":"https:\/\/www.paypal.com\/cgi-bin\/webscr?cmd=_s-xclick&hosted_button_id=92KZCBD2PXMZQ"}}
