{"status":"success","code":200,"message":"ok","data":{"id":"tt5218244","type":"title","title":null,"year":null,"description":"Forced to relinquish the Casket of Cronus, which allows time travel into the past to alter the future, to the Exponoids the crew pursue them to 1950s America, where technology is banned, thus allowing the Exponoids world domination without any challenge. A dying dissident directs them to Harmony De Gaultier, whose speak-easy is frequented by underground scientists, including Einstein Dave, who helps them redress the balance and regain their ship.                Written bydon @ minifie-1","certificate":null,"duration":"28min","released":"2016-09-22","cast":["Chris Barrie","Craig Charles","Danny John-Jules","Robert Llewellyn","Kevin Eldon","Lucie Pohl","David Sterne","Sam Douglas","Rebecca Blackstone","Suanne Braun","David Menkin","Alexis Dubus","Kyle James","Kyle James"],"genres":["comedy","sci-fi"],"directors":[],"writers":[],"image":"https:\/\/images-na.ssl-images-amazon.com\/images\/M\/MV5BMWNmYTg2NTktMTkxYS00ZDEwLTgyMDAtZDBkNjQzZmUzNzMxXkEyXkFqcGdeQXVyNjU1MjIzMTU@._V1_UY268_CR110,0,182,268_AL_.jpg","review":{"text":"Since UK TV got the right to make new Red Dwarf, the opener for series 11 is the one that is more reminiscent to the later series shown on the BBC almost 20 decades ago.The budget is bigger than the previous two series and it shows on screen and the writing was sharper and funnier parodying Star Trek with a cyborg named similar to that of 7 of 9 from ST: Voyager. The crew of Red Dwarf going to what looks like Prohibition era 1920s America only to find out that it is the 1950s where science has been made illegal. Singing, dancing and drinking is fine though. The cyborgs known as Simulants are holding back technology for the benefit of mankind.The episode is tightly directed, every crew member gets a little bit of the spotlight and there are several laughs to be had. It is a long time since I laughed at a new episode of Red Dwarf.","rating":"6\/10"}},"donation":{"message":"Please, donate to keep this service alive and help its further development","donation_url":"https:\/\/www.paypal.com\/cgi-bin\/webscr?cmd=_s-xclick&hosted_button_id=92KZCBD2PXMZQ"}}
