{"status":"success","code":200,"message":"ok","data":{"id":"tt5218308","type":"title","title":null,"year":null,"description":"Kryten has a mid-life crisis as he is half-way through his life cycle and consoles himself with a new crimson shell complete with sub-woofers. To cheer him up the crew decides to introduce him to Butler, a supposedly less intelligent mech but he is extremely sophisticated, making Kryten feel worse. Salvation arrives when Kryten realizes that the very universe itself is also subject to a mid-life crisis and he can help it.                Written bydon @ minifie-1","certificate":null,"duration":"26min","released":"2016-10-20","cast":["Chris Barrie","Craig Charles","Danny John-Jules","Robert Llewellyn","Dominic Coleman","Robert Nairne","Daniel Barker"],"genres":["comedy","sci-fi"],"directors":[],"writers":[],"image":"https:\/\/images-na.ssl-images-amazon.com\/images\/M\/MV5BZmEwMzJiMmEtMTM4NS00ZTNhLWI3MzgtZjRkZjMwZTFhZjVkXkEyXkFqcGdeQXVyOTc1NjYzNg@@._V1_UY268_CR147,0,182,268_AL_.jpg","review":{"text":"A somewhat strange episode that focuses on Kryten&#x27;s new look, not too far off from a red Ferrari. In short he is having a mid life crisis now that he is half a million years old or so. Where have all the years gone and he has accomplished so little, although his primary function seems to have been to serve and these days serve Lister and Cat.Lister realises that Kryten could do with meeting up with another mechanoid and arranges to meet up with Butler who turns out to be a polymath and skilled at everything bringing even more despair to Kryten.Dominic Coleman has fun with Butler (he reminded me a lot of the first actor who played Kryten when he was first introduced.) So good is Butler that Rimmer wants him as part of the Red Dwarf crew. A decent episode with some laughs mainly by Cat and with some sci fi added at the end as the crew encounter the actual universe thanks to the modifications made by Butler.","rating":"6\/10"}},"donation":{"message":"Please, donate to keep this service alive and help its further development","donation_url":"https:\/\/www.paypal.com\/cgi-bin\/webscr?cmd=_s-xclick&hosted_button_id=92KZCBD2PXMZQ"}}
