{"status":"success","code":200,"message":"ok","data":{"id":"tt5218266","type":"title","title":null,"year":null,"description":"The team encounters deranged robot Asclepius which knocks out Lister and Cat. Rimmer disables Asclepius and the crew escapes, only to find that the mad droid removed Lister's kidneys. The only suitable donor is Cat and the medi-bot charged with performing the operation turns out to be the snack dispenser. Fortunately Kryten discovers that time travel may be the answer to saving Lister's life.                Written bydon @ minifie-1","certificate":null,"duration":"29min","released":"2016-10-06","cast":["Chris Barrie","Craig Charles","Danny John-Jules","Robert Llewellyn","Mark Quartley","Tobias Wilson","Oliver Mason","Jami Reid-Quarrell","Daniel Barker"],"genres":["comedy","sci-fi"],"directors":[],"writers":[],"image":"https:\/\/images-na.ssl-images-amazon.com\/images\/M\/MV5BNjU3ODg4MTgtN2I1Mi00MDhjLThjNDgtY2UxMjk3MThhYzNhXkEyXkFqcGdeQXVyOTc1NjYzNg@@._V1_UY268_CR147,0,182,268_AL_.jpg","review":{"text":"This is the first time in years where Red Dwarf feels like Red Dwarf, the series at its peak where it was more than just a cult sci fi comedy on BBC2.The crew find a disused space station that is about to be destroyed by a meteor storm and hop abroad to take a look. What they find is a murderous medical bot. They also find a snack dispenser bot called Snacky that looks like it has turned up from the movie, Forbidden Planet.Lister has his kidneys taken from the medical droid, Kryten and Rimmer rescue them but with Kryten installing a chip that temporary keeps Lister alive until Cat can be persuaded to donate one of his kidneys.This is an episode where the laughs come regularly. Kryten deletes his memory banks and forgets who Rimmer is and starts to call him names. Cat gets the spotlight as we see his selfish side. Snacky initially gets mistaken for a medical bot and everyone things he can fix Lister.As befits a sci fi comedy there is actual timey wimey used so Lister can deal with his lack of kidneys. An episode that makes you go back in time like 20 years or so itself.","rating":"6\/10"}},"donation":{"message":"Please, donate to keep this service alive and help its further development","donation_url":"https:\/\/www.paypal.com\/cgi-bin\/webscr?cmd=_s-xclick&hosted_button_id=92KZCBD2PXMZQ"}}
