{"status":"success","code":200,"message":"ok","data":{"id":"tt5218316","type":"title","title":null,"year":null,"description":"Cat panics when he hears the Red Dwarf may be encountering vampires who only kill virgins so he is relieved and delighted when the crew liberates a glamorous female cat from her abductor. However she is actually a malicious shape shifter who uses Cat as a host for her clones, leading to a stand-off between the crew and their look- alikes before Cat saves the day.                Written bydon @ minifie-1","certificate":null,"duration":"28min","released":"2016-10-27","cast":["Chris Barrie","Craig Charles","Danny John-Jules","Robert Llewellyn","Bentley Kalu","Dominique Moore","Daniel Barker","Maria Yarjah","Shanice Stewart-Jones"],"genres":["comedy","sci-fi"],"directors":[],"writers":[],"image":"https:\/\/images-na.ssl-images-amazon.com\/images\/M\/MV5BYjc4NjU3ZGMtN2E2Zi00MjQ3LWJjYzQtMTZiMWM2MzJjYzRiXkEyXkFqcGdeQXVyOTc1NjYzNg@@._V1_UY268_CR147,0,182,268_AL_.jpg","review":{"text":"The final episode of the eleventh series of Red Dwarf just has something derivative about it as it seems to have elements from past stories.Ir starts of with Kryten trying to tempt Rimmer to use a personality changing machine. As they go to see Lister they find that Starbug has gone off course because Lister fell asleep after Sunday lunch. It is now Monday. They are now in an asteroid belt that is home to the Vampire- Gelfs that seek out virgins much to Cat&#x27;s dismay.As they decide to go round a longer route they find another ship that has a Mercenoid carrying a prisoner heading for a black hole. The Mercenoid is willing to give up his life for the promise of free upgrades in the afterlife. The crew decides to rescue the prisoner even though they have no idea how dangerous the prisoner might be.It turns out that the prisoner is a female cat, which means plenty of James Brown type caterwauling. It is just too good to be true as the female cat is a Polymorph that plans to lay eggs in Cat while he thinks he is mating with her. The rest of the crew now realise how dangerous the prisoner was. They now have to find a way of Cat giving birth to little polymorphs and disposing of them.A fair episode but I got the feeling that the writer might have run out of ideas here because I felt I have seen it all before. Amusing but nothing laugh out loud.","rating":"5\/10"}},"donation":{"message":"Please, donate to keep this service alive and help its further development","donation_url":"https:\/\/www.paypal.com\/cgi-bin\/webscr?cmd=_s-xclick&hosted_button_id=92KZCBD2PXMZQ"}}
