{"status":"success","code":200,"message":"ok","data":{"id":"tt5218254","type":"title","title":null,"year":null,"description":"After receiving a mysterious message the Red Dwarf investigates the Samsara, a spaceship stuck on the ocean bed and full of the skeletons of its crew. With the power out they believe they are stranded until Kryten realizes that the ship carries a Karma Drive, which punishes bad behaviour but rewards virtuous acts. Somehow the machine must have had its programme reversed as Cat and Lister discover when they try to be nice to each other. Nastiness now seems to be the key to survival.                Written bydon @ minifie-1","certificate":null,"duration":"29min","released":"2016-09-29","cast":["Chris Barrie","Craig Charles","Danny John-Jules","Robert Llewellyn","Dan Tetsell","Maggie Service","Eddie Bagayawa"],"genres":["comedy","sci-fi"],"directors":[],"writers":[],"image":"https:\/\/images-na.ssl-images-amazon.com\/images\/M\/MV5BMDI2NjUwYTgtMTFiOC00NjI0LTk0MjUtNTg3OWUxZWM3ZGExXkEyXkFqcGdeQXVyNTM4ODE3ODY@._V1_UY268_CR140,0,182,268_AL_.jpg","review":{"text":"After a bigger budget and funny first episode, the second episode &#x27;Samsara&#x27; did not quiet do it for me.It was less funny but well structured. We do get enough time with our foursome such as Lister and Rimmer playing Mineopoly with Lister cheating. Later on Cat and Rimmer chat about Archimedes and evolution of cats and apes.Then again cheating is at the heart of this episode. The crew find an escape pod but the two human passengers being suddenly turned to dust. When they explore a nearby crashed ship they see skeletons and have to figure out what caused the deaths.We see flashbacks of two crew members Barker and Green having an illicit affair which went against the ship&#x27;s karma drive machine that was designed to reward good behaviour and punish bad.Kryten realises that the crew are in danger as somehow the karma drive was reprogrammed to reward bad behaviour.The episode had Kryten explaining what was going on a lot, which left less time for the knockabout larking, yet there were still a few good laughs here.","rating":"5\/10"}},"donation":{"message":"Please, donate to keep this service alive and help its further development","donation_url":"https:\/\/www.paypal.com\/cgi-bin\/webscr?cmd=_s-xclick&hosted_button_id=92KZCBD2PXMZQ"}}
